# config.py - ملف الإعدادات
import os

# ==================== إعدادات البوت ====================
BOT_TOKEN = "8942434562:AAEgIs6ANM2gwloPfUAj_NPPsteLYRNjRW4"  # ضع توكن البوت هنا

# ==================== ايديات الأدمن ====================
ADMIN_IDS = [
    8743242936,  # الأدمن الأول
    8462976537,  # الأدمن الثاني
]

# ==================== القناة والمجموعة ====================
CHANNEL_USERNAME = "https://t.me/+9iHTnvi2_hxjZWE0"  # معرف القناة
CHANNEL_ID = -1001234567890  # ايدي القناة الرقمي (سالب)

GROUP_USERNAME = "https://t.me/sodan249"  # معرف المجموعة
GROUP_ID = -1001234567890  # ايدي المجموعة الرقمي (سالب)

# ==================== يوزر المطور ====================
U_M_P_249 = "yourusername"  # بدون @
